app/Controllers/ProductController.php

    public function index() {
        if (!$this->checkAuth()) return redirect()->to('/login');
        $model = new ProductModel();
        $data['products'] = $model->findAll();
---
SELECT *
FROM `products`