app/Controllers/StoreController.php

    public function sales()
    {
        if (!$this->checkAuth()) return redirect()->to('/login');

        $prodModel = new ProductModel();
        $db = \Config\Database::connect();

        // 1. Fetch Today's Date
        $today = date('Y-m-d');

        // 2. Performance Stats: Today's Revenue
        $data['today_revenue'] = $db->table('sales')
            ->selectSum('total_price')
            ->where('DATE(created_at)', $today)
            ->get()->getRow()->total_price ?? 0;

        // 3. Performance Stats: Today's Items Sold Count
        $data['today_items_sold'] = $db->table('sales')
            ->selectSum('quantity')
            ->where('DATE(created_at)', $today)
            ->get()->getRow()->quantity ?? 0;

        // 4. Products available for sale (Stock > 0)
        $data['available_products'] = $prodModel->where('stock >', 0)->findAll();

        // 5. All products for the "Real-Time Inventory Status" list
        $data['all_products'] = $prodModel->orderBy('stock', 'ASC')->findAll();

        // 6. Recent Sales History (Joined with products to get names)
        $data['sales_history'] = $db->table('sales')
            ->select('sales.*, products.name as product_name')
            ->join('products', 'products.id = sales.product_id')
            ->orderBy('sales.id', 'DESC')
            ->limit(10)
            ->get()->getResultArray();
---
SELECT SUM(`total_price`) AS `total_price`
FROM `sales`
WHERE DATE(created_at) = '2026-04-16'
SELECT SUM(`quantity`) AS `quantity`
FROM `sales`
WHERE DATE(created_at) = '2026-04-16'
SELECT *
FROM `products`
WHERE `stock` > 0
SELECT *
FROM `products`
ORDER BY `stock` ASC
SELECT `sales`.*, `products`.`name` as `product_name`
FROM `sales`
JOIN `products` ON `products`.`id` = `sales`.`product_id`
ORDER BY `sales`.`id` DESC
 LIMIT 10

    public function storeSale()
    {
        if (!$this->checkAuth()) return redirect()->to('/login');

        $prodModel = new ProductModel();
        $saleModel = new SaleModel();
        $cashModel = new CashFlowModel();

        $productId = $this->request->getVar('product_id');
        $qty = (int)$this->request->getVar('quantity');

        // Validation
        if (empty($productId) || $qty <= 0) {
            return redirect()->to('/sales')->with('error', 'Please select a product and valid quantity.');
        }

        $product = $prodModel->find($productId);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '4'

        $db->transStart();

        // 1. Save Sale Record
        $saleModel->save([
            'product_id'  => $productId,
            'quantity'    => $qty,
            'total_price' => $totalPrice
        ]);

        // 2. Update Product Stock (Deduct)
        $prodModel->update($productId, [
            'stock' => $product['stock'] - $qty
        ]);
---
INSERT INTO `sales` (`product_id`, `quantity`, `total_price`) VALUES ('4', 1, 15)
UPDATE `products` SET `stock` = 49
WHERE `products`.`id` IN ('4')