app/Controllers/UserController.php

    public function index()
    {
        if (!$this->checkAuth()) return redirect()->to('/login');

        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`